Public Member Functions | Friends | List of all members
IFCAPI::PropertyBuilder Class Referencefinal
IFC Data Access
To create IFC attribute, property or classification reference. More...
#include <IFCPropertyBuilder.hpp>
 Inheritance diagram for IFCAPI::PropertyBuilder:
 Public Member Functions
ACAPI::Result< Value >  | CreateValue (const IFCAPI::IFCType &valueType, const IFCAPI::AnyValue &anyValue) const
Create an IFC value.
ACAPI::Result< Value >  | CreateDefaultValue (const IFCAPI::IFCType &valueType) const
Create a default IFC value based on the IFC type.
Value  | CreateEmptyValue () const
Create an empty IFC value.
ACAPI::Result< IFCAPI::Attribute >  | CreateAttribute (const GS::UniString &name, const std::optional< GS::UniString > &value) const
Create an IFC attribute from scratch.
ACAPI::Result< IFCAPI::Property >  | CreatePropertySingleValue (const GS::UniString &propertySetName, const GS::UniString &name, const IFCAPI::Value &value) const
Create an IFC property single value.
ACAPI::Result< IFCAPI::Property >  | CreatePropertyTableValue (const GS::UniString &propertySetName, const GS::UniString &name, const std::vector< IFCAPI::Value > &definingValues, const std::vector< IFCAPI::Value > &definedValues) const
Create an IFC property table value.
ACAPI::Result< IFCAPI::Property >  | CreatePropertyListValue (const GS::UniString &propertySetName, const GS::UniString &name, const std::vector< IFCAPI::Value > &listValues) const
Create an IFC property list value.
ACAPI::Result< IFCAPI::Property >  | CreatePropertyBoundedValue (const GS::UniString &propertySetName, const GS::UniString &name, const IFCAPI::Value &lowerBoundValue, const IFCAPI::Value &upperBoundValue, const IFCAPI::Value &setPointValue) const
Create an IFC property bounded value.
ACAPI::Result< IFCAPI::Property >  | CreatePropertyEnumeratedValue (const GS::UniString &propertySetName, const GS::UniString &name, const std::vector< IFCAPI::Value > &enumerationReference, const std::vector< IFCAPI::Value > &enumeratedValues) const
Create an IFC property enumerated value.
ACAPI::Result< IFCAPI::Classification >  | CreateClassification (const GS::UniString &name, const std::optional< GS::UniString > &source, const std::optional< GS::UniString > &edition, const std::optional< GS::UniString > &editionDate, const std::optional< GS::UniString > &description, const std::optional< GS::UniString > &location) const
Create an IFC classification from scratch.
ACAPI::Result< ClassificationReference >  | CreateClassificationReference (const std::optional< GS::UniString > &location, const std::optional< GS::UniString > &identification, const std::optional< GS::UniString > &name, const std::optional< GS::UniString > &description, const std::optional< GS::UniString > &sort, const IFCAPI::Classification &referencedSource, const GS::UniString &relAssociatesClassificationName) const
Create an IFC classification reference from scratch.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
PropertyBuilder  | GetPropertyBuilder ()
Get PropertyBuilder to create IFC attribute, property or classification reference.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
To create IFC attribute, property or classification reference.
Since
Archicad 28
Remarks
See IFCHook_Test.cpp for a complete example.
Friends And Related Symbol Documentation
◆ GetPropertyBuilder
 PropertyBuilder GetPropertyBuilder  |  ( |   | )
friend
Get PropertyBuilder to create IFC attribute, property or classification reference.
Since
Archicad 28
Returns
The PropertyBuilder
Remarks
See IFCHook_Test.cpp for a complete example.